grevaillot/svd_tools/headers/STM32F7x2/otg_fs_global.h
#pragma once 

/* --- OTG_FS_GLOBAL: USB on the go full speed ---------------------- */

/** @defgroup otg_fs_global_registers USB on the go full speed Register
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL OTG_FS control and status register (OTG_FS_GOTGCTL) **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL			MMIO32(OTG_FS_GLOBAL_BASE + 0x00)
/** OTG_FS_GLOBAL_OTG_FS_GOTGINT OTG_FS interrupt register (OTG_FS_GOTGINT) **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGINT			MMIO32(OTG_FS_GLOBAL_BASE + 0x04)
/** OTG_FS_GLOBAL_OTG_FS_GAHBCFG OTG_FS AHB configuration register (OTG_FS_GAHBCFG) **/
#define OTG_FS_GLOBAL_OTG_FS_GAHBCFG			MMIO32(OTG_FS_GLOBAL_BASE + 0x08)
/** OTG_FS_GLOBAL_OTG_FS_GUSBCFG OTG_FS USB configuration register (OTG_FS_GUSBCFG) **/
#define OTG_FS_GLOBAL_OTG_FS_GUSBCFG			MMIO32(OTG_FS_GLOBAL_BASE + 0x0c)
/** OTG_FS_GLOBAL_OTG_FS_GRSTCTL OTG_FS reset register (OTG_FS_GRSTCTL) **/
#define OTG_FS_GLOBAL_OTG_FS_GRSTCTL			MMIO32(OTG_FS_GLOBAL_BASE + 0x10)
/** OTG_FS_GLOBAL_OTG_FS_GINTSTS OTG_FS core interrupt register (OTG_FS_GINTSTS) **/
#define OTG_FS_GLOBAL_OTG_FS_GINTSTS			MMIO32(OTG_FS_GLOBAL_BASE + 0x14)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK OTG_FS interrupt mask register (OTG_FS_GINTMSK) **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK			MMIO32(OTG_FS_GLOBAL_BASE + 0x18)
/** OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device OTG_FS Receive status debug read(Device mode) **/
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device			MMIO32(OTG_FS_GLOBAL_BASE + 0x1c)
/** OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host OTG_FS Receive status debug read(Host mode) **/
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host			MMIO32(OTG_FS_GLOBAL_BASE + 0x1c)
/** OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device OTG status read and pop register (Device mode) **/
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device			MMIO32(OTG_FS_GLOBAL_BASE + 0x20)
/** OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host OTG status read and pop register (Host mode) **/
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host			MMIO32(OTG_FS_GLOBAL_BASE + 0x20)
/** OTG_FS_GLOBAL_OTG_FS_GRXFSIZ OTG_FS Receive FIFO size register (OTG_FS_GRXFSIZ) **/
#define OTG_FS_GLOBAL_OTG_FS_GRXFSIZ			MMIO32(OTG_FS_GLOBAL_BASE + 0x24)
/** OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device OTG_FS Endpoint 0 Transmit FIFO size **/
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device			MMIO32(OTG_FS_GLOBAL_BASE + 0x28)
/** OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host OTG_FS Host non-periodic transmit FIFO size register **/
#define OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host			MMIO32(OTG_FS_GLOBAL_BASE + 0x28)
/** OTG_FS_GLOBAL_OTG_FS_HNPTXSTS OTG_FS non-periodic transmit FIFO/queue status register (OTG_FS_GNPTXSTS) **/
#define OTG_FS_GLOBAL_OTG_FS_HNPTXSTS			MMIO32(OTG_FS_GLOBAL_BASE + 0x2c)
/** OTG_FS_GLOBAL_OTG_FS_GI2CCTL OTG I2C access register **/
#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL			MMIO32(OTG_FS_GLOBAL_BASE + 0x30)
/** OTG_FS_GLOBAL_OTG_FS_GCCFG OTG_FS general core configuration register (OTG_FS_GCCFG) **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG			MMIO32(OTG_FS_GLOBAL_BASE + 0x38)
/** OTG_FS_GLOBAL_OTG_FS_CID core ID register **/
#define OTG_FS_GLOBAL_OTG_FS_CID			MMIO32(OTG_FS_GLOBAL_BASE + 0x3c)
/** OTG_FS_GLOBAL_OTG_FS_GLPMCFG OTG core LPM configuration register **/
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG			MMIO32(OTG_FS_GLOBAL_BASE + 0x54)
/** OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ OTG_FS Host periodic transmit FIFO size register (OTG_FS_HPTXFSIZ) **/
#define OTG_FS_GLOBAL_OTG_FS_HPTXFSIZ			MMIO32(OTG_FS_GLOBAL_BASE + 0x100)
/** OTG_FS_GLOBAL_OTG_FS_DIEPTXF1 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF1) **/
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF1			MMIO32(OTG_FS_GLOBAL_BASE + 0x104)
/** OTG_FS_GLOBAL_OTG_FS_DIEPTXF2 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF2) **/
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF2			MMIO32(OTG_FS_GLOBAL_BASE + 0x108)
/** OTG_FS_GLOBAL_OTG_FS_DIEPTXF3 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF3) **/
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF3			MMIO32(OTG_FS_GLOBAL_BASE + 0x10c)
/** OTG_FS_GLOBAL_OTG_FS_DIEPTXF4 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF4) **/
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF4			MMIO32(OTG_FS_GLOBAL_BASE + 0x110)
/** OTG_FS_GLOBAL_OTG_FS_DIEPTXF5 OTG_FS device IN endpoint transmit FIFO size register (OTG_FS_DIEPTXF5) **/
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF5			MMIO32(OTG_FS_GLOBAL_BASE + 0x114)

/**@}*/


/** @defgroup otg_fs_global_otg_fs_gotgctl OTGFSGOTGCTL OTG_FS control and status register (OTG_FS_GOTGCTL)
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_OTGVER OTG version **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_OTGVER		(1 << 20)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_BSVLD B-session valid **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_BSVLD		(1 << 19)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_ASVLD A-session valid **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_ASVLD		(1 << 18)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_DBCT Long/short debounce time **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_DBCT		(1 << 17)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_CIDSTS Connector ID status **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_CIDSTS		(1 << 16)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_EHEN Embedded host enable **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_EHEN		(1 << 12)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_DHNPEN Device HNP enabled **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_DHNPEN		(1 << 11)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_HSHNPEN Host set HNP enable **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_HSHNPEN		(1 << 10)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_HNPRQ HNP request **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_HNPRQ		(1 << 9)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_HNGSCS Host negotiation success **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_HNGSCS		(1 << 8)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_BVALOVAL B-peripheral session valid override value **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_BVALOVAL		(1 << 7)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_BVALOEN B-peripheral session valid override enable **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_BVALOEN		(1 << 6)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_AVALOVAL A-peripheral session valid override value **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_AVALOVAL		(1 << 5)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_AVALOEN A-peripheral session valid override enable **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_AVALOEN		(1 << 4)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_VBVALOVAL VBUS valid override value **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_VBVALOVAL		(1 << 3)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_VBVALOEN VBUS valid override enable **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_VBVALOEN		(1 << 2)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_SRQ Session request **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_SRQ		(1 << 1)
/** OTG_FS_GLOBAL_OTG_FS_GOTGCTL_SRQSCS Session request success **/
#define OTG_FS_GLOBAL_OTG_FS_GOTGCTL_SRQSCS		(1 << 0)

/**@}*/

/** @defgroup otg_fs_global_otg_fs_gotgint OTGFSGOTGINT OTG_FS interrupt register (OTG_FS_GOTGINT)
@{*/

