grevaillot/svd_tools/headers/STM32F7x2/otg_fs_global.h
/** @defgroup otg_fs_global_otg_fs_gintmsk OTGFSGINTMSK OTG_FS interrupt mask register (OTG_FS_GINTMSK)
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_WUIM Resume/remote wakeup detected interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_WUIM		(1 << 31)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_SRQIM Session request/new session detected interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_SRQIM		(1 << 30)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_DISCINT Disconnect detected interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_DISCINT		(1 << 29)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_CIDSCHGM Connector ID status change mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_CIDSCHGM		(1 << 28)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_LPMIN LPM interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_LPMIN		(1 << 27)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_PTXFEM Periodic TxFIFO empty mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_PTXFEM		(1 << 26)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_HCIM Host channels interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_HCIM		(1 << 25)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_PRTIM Host port interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_PRTIM		(1 << 24)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_RSTDETM Reset detected interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_RSTDETM		(1 << 23)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_IPXFRM_IISOOXFRM Incomplete periodic transfer mask(Host mode)/Incomplete isochronous OUT transfer mask(Device mode) **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_IPXFRM_IISOOXFRM		(1 << 21)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_IISOIXFRM Incomplete isochronous IN transfer mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_IISOIXFRM		(1 << 20)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_OEPINT OUT endpoints interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_OEPINT		(1 << 19)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_IEPINT IN endpoints interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_IEPINT		(1 << 18)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_EOPFM End of periodic frame interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_EOPFM		(1 << 15)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_ISOODRPM Isochronous OUT packet dropped interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_ISOODRPM		(1 << 14)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_ENUMDNEM Enumeration done mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_ENUMDNEM		(1 << 13)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_USBRST USB reset mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_USBRST		(1 << 12)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_USBSUSPM USB suspend mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_USBSUSPM		(1 << 11)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_ESUSPM Early suspend mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_ESUSPM		(1 << 10)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_GONAKEFFM Global OUT NAK effective mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_GONAKEFFM		(1 << 7)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_GINAKEFFM Global non-periodic IN NAK effective mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_GINAKEFFM		(1 << 6)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_NPTXFEM Non-periodic TxFIFO empty mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_NPTXFEM		(1 << 5)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_RXFLVLM Receive FIFO non-empty mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_RXFLVLM		(1 << 4)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_SOFM Start of frame mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_SOFM		(1 << 3)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_OTGINT OTG interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_OTGINT		(1 << 2)
/** OTG_FS_GLOBAL_OTG_FS_GINTMSK_MMISM Mode mismatch interrupt mask **/
#define OTG_FS_GLOBAL_OTG_FS_GINTMSK_MMISM		(1 << 1)

/**@}*/

/** @defgroup otg_fs_global_otg_fs_grxstsr_device OTGFSGRXSTSRDevice OTG_FS Receive status debug read(Device mode)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_FRMNUM_SHIFT		21
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_FRMNUM_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_grxstsr_device_frmnum FRMNUM Frame number
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_PKTSTS_SHIFT		17
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_PKTSTS_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_grxstsr_device_pktsts PKTSTS Packet status
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_DPID_SHIFT		15
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_DPID_MASK		0x03
/** @defgroup otg_fs_global_otg_fs_grxstsr_device_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_BCNT_SHIFT		4
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_BCNT_MASK		0x7ff
/** @defgroup otg_fs_global_otg_fs_grxstsr_device_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_EPNUM_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Device_EPNUM_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_grxstsr_device_epnum EPNUM Endpoint number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_grxstsr_host OTGFSGRXSTSRHost OTG_FS Receive status debug read(Host mode)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_PKTSTS_SHIFT		17
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_PKTSTS_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_grxstsr_host_pktsts PKTSTS Packet status
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_DPID_SHIFT		15
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_DPID_MASK		0x03
/** @defgroup otg_fs_global_otg_fs_grxstsr_host_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_BCNT_SHIFT		4
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_BCNT_MASK		0x7ff
/** @defgroup otg_fs_global_otg_fs_grxstsr_host_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_CHNUM_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSR_Host_CHNUM_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_grxstsr_host_chnum CHNUM Endpoint number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_grxstsp_device OTGFSGRXSTSPDevice OTG status read and pop register (Device mode)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_FRMNUM_SHIFT		21
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_FRMNUM_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_grxstsp_device_frmnum FRMNUM Frame number
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_PKTSTS_SHIFT		17
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_PKTSTS_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_grxstsp_device_pktsts PKTSTS Packet status
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_DPID_SHIFT		15
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_DPID_MASK		0x03
/** @defgroup otg_fs_global_otg_fs_grxstsp_device_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_BCNT_SHIFT		4
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_BCNT_MASK		0x7ff
/** @defgroup otg_fs_global_otg_fs_grxstsp_device_bcnt BCNT Byte count
@{*/
/**@}*/


