grevaillot/svd_tools/headers/STM32F7x2/otg_fs_global.h
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_EPNUM_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Device_EPNUM_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_grxstsp_device_epnum EPNUM Endpoint number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_grxstsp_host OTGFSGRXSTSPHost OTG status read and pop register (Host mode)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_PKTSTS_SHIFT		17
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_PKTSTS_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_grxstsp_host_pktsts PKTSTS Packet status
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_DPID_SHIFT		15
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_DPID_MASK		0x03
/** @defgroup otg_fs_global_otg_fs_grxstsp_host_dpid DPID Data PID
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_BCNT_SHIFT		4
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_BCNT_MASK		0x7ff
/** @defgroup otg_fs_global_otg_fs_grxstsp_host_bcnt BCNT Byte count
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_CHNUM_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_GRXSTSP_Host_CHNUM_MASK		0x0f
/** @defgroup otg_fs_global_otg_fs_grxstsp_host_chnum CHNUM Channel number
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_grxfsiz OTGFSGRXFSIZ OTG_FS Receive FIFO size register (OTG_FS_GRXFSIZ)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_GRXFSIZ_RXFD_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_GRXFSIZ_RXFD_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_grxfsiz_rxfd RXFD RxFIFO depth
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_dieptxf0_device OTGFSDIEPTXF0Device OTG_FS Endpoint 0 Transmit FIFO size
@{*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device_TX0FD_SHIFT		16
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device_TX0FD_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf0_device_tx0fd TX0FD Endpoint 0 TxFIFO depth
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device_TX0FSA_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_DIEPTXF0_Device_TX0FSA_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_dieptxf0_device_tx0fsa TX0FSA Endpoint 0 transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_hnptxfsiz_host OTGFSHNPTXFSIZHost OTG_FS Host non-periodic transmit FIFO size register
@{*/


#define OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host_NPTXFD_SHIFT		16
#define OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host_NPTXFD_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_hnptxfsiz_host_nptxfd NPTXFD Non-periodic TxFIFO depth
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host_NPTXFSA_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_HNPTXFSIZ_Host_NPTXFSA_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_hnptxfsiz_host_nptxfsa NPTXFSA Non-periodic transmit RAM start address
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_hnptxsts OTGFSHNPTXSTS OTG_FS non-periodic transmit FIFO/queue status register (OTG_FS_GNPTXSTS)
@{*/


#define OTG_FS_GLOBAL_OTG_FS_HNPTXSTS_NPTXQTOP_SHIFT		24
#define OTG_FS_GLOBAL_OTG_FS_HNPTXSTS_NPTXQTOP_MASK		0x7f
/** @defgroup otg_fs_global_otg_fs_hnptxsts_nptxqtop NPTXQTOP Top of the non-periodic transmit request queue
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_HNPTXSTS_NPTQXSAV_SHIFT		16
#define OTG_FS_GLOBAL_OTG_FS_HNPTXSTS_NPTQXSAV_MASK		0xff
/** @defgroup otg_fs_global_otg_fs_hnptxsts_nptqxsav NPTQXSAV Non-periodic transmit request queue space available
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_HNPTXSTS_NPTXFSAV_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_HNPTXSTS_NPTXFSAV_MASK		0xffff
/** @defgroup otg_fs_global_otg_fs_hnptxsts_nptxfsav NPTXFSAV Non-periodic TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_gi2cctl OTGFSGI2CCTL OTG I2C access register
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GI2CCTL_BSYDNE I2C Busy/Done **/
#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_BSYDNE		(1 << 31)
/** OTG_FS_GLOBAL_OTG_FS_GI2CCTL_RW Read/Write Indicator **/
#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_RW		(1 << 30)
/** OTG_FS_GLOBAL_OTG_FS_GI2CCTL_I2CDATSE0 I2C DatSe0 USB mode **/
#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_I2CDATSE0		(1 << 28)

#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_I2CDEVADR_SHIFT		26
#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_I2CDEVADR_MASK		0x03
/** @defgroup otg_fs_global_otg_fs_gi2cctl_i2cdevadr I2CDEVADR I2C Device Address
@{*/
/**@}*/

/** OTG_FS_GLOBAL_OTG_FS_GI2CCTL_ACK I2C ACK **/
#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_ACK		(1 << 24)
/** OTG_FS_GLOBAL_OTG_FS_GI2CCTL_I2CEN I2C Enable **/
#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_I2CEN		(1 << 23)

#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_ADDR_SHIFT		16
#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_ADDR_MASK		0x7f
/** @defgroup otg_fs_global_otg_fs_gi2cctl_addr ADDR I2C Address
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_REGADDR_SHIFT		8
#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_REGADDR_MASK		0xff
/** @defgroup otg_fs_global_otg_fs_gi2cctl_regaddr REGADDR I2C Register Address
@{*/
/**@}*/


#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_RWDATA_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_GI2CCTL_RWDATA_MASK		0xff
/** @defgroup otg_fs_global_otg_fs_gi2cctl_rwdata RWDATA I2C Read/Write Data
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_gccfg OTGFSGCCFG OTG_FS general core configuration register (OTG_FS_GCCFG)
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GCCFG_VBDEN USB VBUS detection enable **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG_VBDEN		(1 << 21)
/** OTG_FS_GLOBAL_OTG_FS_GCCFG_SDEN Secondary detection (SD) mode enable **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG_SDEN		(1 << 20)
/** OTG_FS_GLOBAL_OTG_FS_GCCFG_PDEN Primary detection (PD) mode enable **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG_PDEN		(1 << 19)
/** OTG_FS_GLOBAL_OTG_FS_GCCFG_DCDEN Data contact detection (DCD) mode enable **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG_DCDEN		(1 << 18)
/** OTG_FS_GLOBAL_OTG_FS_GCCFG_BCDEN Battery charging detector (BCD) enable **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG_BCDEN		(1 << 17)
/** OTG_FS_GLOBAL_OTG_FS_GCCFG_PWRDWN Power down **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG_PWRDWN		(1 << 16)
/** OTG_FS_GLOBAL_OTG_FS_GCCFG_PS2DET DM pull-up detection status **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG_PS2DET		(1 << 3)
/** OTG_FS_GLOBAL_OTG_FS_GCCFG_SDET Secondary detection (SD) status **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG_SDET		(1 << 2)
/** OTG_FS_GLOBAL_OTG_FS_GCCFG_PDET Primary detection (PD) status **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG_PDET		(1 << 1)
/** OTG_FS_GLOBAL_OTG_FS_GCCFG_DCDET Data contact detection (DCD) status **/
#define OTG_FS_GLOBAL_OTG_FS_GCCFG_DCDET		(1 << 0)

/**@}*/

/** @defgroup otg_fs_global_otg_fs_cid OTGFSCID core ID register
@{*/


#define OTG_FS_GLOBAL_OTG_FS_CID_PRODUCT_ID_SHIFT		0
#define OTG_FS_GLOBAL_OTG_FS_CID_PRODUCT_ID_MASK		0xffffffff
/** @defgroup otg_fs_global_otg_fs_cid_product_id PRODUCTID Product ID field
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_global_otg_fs_glpmcfg OTGFSGLPMCFG OTG core LPM configuration register
@{*/

/** OTG_FS_GLOBAL_OTG_FS_GLPMCFG_ENBESL Enable best effort service latency **/
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_ENBESL		(1 << 28)

#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMRCNTSTS_SHIFT		25
#define OTG_FS_GLOBAL_OTG_FS_GLPMCFG_LPMRCNTSTS_MASK		0x07
/** @defgroup otg_fs_global_otg_fs_glpmcfg_lpmrcntsts LPMRCNTSTS LPM retry count status
@{*/
/**@}*/

